zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam0/include/same54/same54n19a.h
/**
 * \file
 *
 * \brief Header file for SAME54N19A
 *
 * Copyright (c) 2019 Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAME54N19A_
#define _SAME54N19A_

/**
 * \ingroup SAME54_definitions
 * \addtogroup SAME54N19A_definitions SAME54N19A definitions
 * This file defines all structures and symbols for SAME54N19A:
 *   - registers and bitfields
 *   - peripheral base address
 *   - peripheral ID
 *   - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#endif

#if !defined(SKIP_INTEGER_LITERALS)
#if defined(_U_) || defined(_L_) || defined(_UL_)
  #error "Integer Literals macros already defined elsewhere"
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#define _U_(x)         x ## U            /**< C code: Unsigned integer literal constant value */
#define _L_(x)         x ## L            /**< C code: Long integer literal constant value */
#define _UL_(x)        x ## UL           /**< C code: Unsigned Long integer literal constant value */
#else /* Assembler */
#define _U_(x)         x                 /**< Assembler: Unsigned integer literal constant value */
#define _L_(x)         x                 /**< Assembler: Long integer literal constant value */
#define _UL_(x)        x                 /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/**  CMSIS DEFINITIONS FOR SAME54N19A */
/* ************************************************************************** */
/** \defgroup SAME54N19A_cmsis CMSIS Definitions */
/*@{*/

/** Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M4 Processor Exceptions Numbers *******************/
  NonMaskableInt_IRQn      = -14,/**<  2 Non Maskable Interrupt      */
  HardFault_IRQn           = -13,/**<  3 Hard Fault Interrupt        */
  MemoryManagement_IRQn    = -12,/**<  4 Memory Management Interrupt */
  BusFault_IRQn            = -11,/**<  5 Bus Fault Interrupt         */
  UsageFault_IRQn          = -10,/**<  6 Usage Fault Interrupt       */
  SVCall_IRQn              = -5, /**< 11 SV Call Interrupt           */
  DebugMonitor_IRQn        = -4, /**< 12 Debug Monitor Interrupt     */
  PendSV_IRQn              = -2, /**< 14 Pend SV Interrupt           */
  SysTick_IRQn             = -1, /**< 15 System Tick Interrupt       */
  /******  SAME54N19A-specific Interrupt Numbers *********************/
  PM_IRQn                  =  0, /**<  0 SAME54N19A Power Manager (PM) */
  MCLK_IRQn                =  1, /**<  1 SAME54N19A Main Clock (MCLK) */
  OSCCTRL_0_IRQn           =  2, /**<  2 SAME54N19A Oscillators Control (OSCCTRL) IRQ 0 */
  OSCCTRL_1_IRQn           =  3, /**<  3 SAME54N19A Oscillators Control (OSCCTRL) IRQ 1 */
  OSCCTRL_2_IRQn           =  4, /**<  4 SAME54N19A Oscillators Control (OSCCTRL) IRQ 2 */
  OSCCTRL_3_IRQn           =  5, /**<  5 SAME54N19A Oscillators Control (OSCCTRL) IRQ 3 */
  OSCCTRL_4_IRQn           =  6, /**<  6 SAME54N19A Oscillators Control (OSCCTRL) IRQ 4 */
  OSC32KCTRL_IRQn          =  7, /**<  7 SAME54N19A 32kHz Oscillators Control (OSC32KCTRL) */
  SUPC_0_IRQn              =  8, /**<  8 SAME54N19A Supply Controller (SUPC) IRQ 0 */
  SUPC_1_IRQn              =  9, /**<  9 SAME54N19A Supply Controller (SUPC) IRQ 1 */
  WDT_IRQn                 = 10, /**< 10 SAME54N19A Watchdog Timer (WDT) */
  RTC_IRQn                 = 11, /**< 11 SAME54N19A Real-Time Counter (RTC) */
  EIC_0_IRQn               = 12, /**< 12 SAME54N19A External Interrupt Controller (EIC) IRQ 0 */
  EIC_1_IRQn               = 13, /**< 13 SAME54N19A External Interrupt Controller (EIC) IRQ 1 */
  EIC_2_IRQn               = 14, /**< 14 SAME54N19A External Interrupt Controller (EIC) IRQ 2 */
  EIC_3_IRQn               = 15, /**< 15 SAME54N19A External Interrupt Controller (EIC) IRQ 3 */
  EIC_4_IRQn               = 16, /**< 16 SAME54N19A External Interrupt Controller (EIC) IRQ 4 */
  EIC_5_IRQn               = 17, /**< 17 SAME54N19A External Interrupt Controller (EIC) IRQ 5 */
  EIC_6_IRQn               = 18, /**< 18 SAME54N19A External Interrupt Controller (EIC) IRQ 6 */
  EIC_7_IRQn               = 19, /**< 19 SAME54N19A External Interrupt Controller (EIC) IRQ 7 */
  EIC_8_IRQn               = 20, /**< 20 SAME54N19A External Interrupt Controller (EIC) IRQ 8 */
  EIC_9_IRQn               = 21, /**< 21 SAME54N19A External Interrupt Controller (EIC) IRQ 9 */
  EIC_10_IRQn              = 22, /**< 22 SAME54N19A External Interrupt Controller (EIC) IRQ 10 */
  EIC_11_IRQn              = 23, /**< 23 SAME54N19A External Interrupt Controller (EIC) IRQ 11 */
  EIC_12_IRQn              = 24, /**< 24 SAME54N19A External Interrupt Controller (EIC) IRQ 12 */
  EIC_13_IRQn              = 25, /**< 25 SAME54N19A External Interrupt Controller (EIC) IRQ 13 */
  EIC_14_IRQn              = 26, /**< 26 SAME54N19A External Interrupt Controller (EIC) IRQ 14 */
  EIC_15_IRQn              = 27, /**< 27 SAME54N19A External Interrupt Controller (EIC) IRQ 15 */
  FREQM_IRQn               = 28, /**< 28 SAME54N19A Frequency Meter (FREQM) */
  NVMCTRL_0_IRQn           = 29, /**< 29 SAME54N19A Non-Volatile Memory Controller (NVMCTRL) IRQ 0 */
  NVMCTRL_1_IRQn           = 30, /**< 30 SAME54N19A Non-Volatile Memory Controller (NVMCTRL) IRQ 1 */
  DMAC_0_IRQn              = 31, /**< 31 SAME54N19A Direct Memory Access Controller (DMAC) IRQ 0 */
  DMAC_1_IRQn              = 32, /**< 32 SAME54N19A Direct Memory Access Controller (DMAC) IRQ 1 */
  DMAC_2_IRQn              = 33, /**< 33 SAME54N19A Direct Memory Access Controller (DMAC) IRQ 2 */
  DMAC_3_IRQn              = 34, /**< 34 SAME54N19A Direct Memory Access Controller (DMAC) IRQ 3 */
  DMAC_4_IRQn              = 35, /**< 35 SAME54N19A Direct Memory Access Controller (DMAC) IRQ 4 */
  EVSYS_0_IRQn             = 36, /**< 36 SAME54N19A Event System Interface (EVSYS) IRQ 0 */
  EVSYS_1_IRQn             = 37, /**< 37 SAME54N19A Event System Interface (EVSYS) IRQ 1 */
  EVSYS_2_IRQn             = 38, /**< 38 SAME54N19A Event System Interface (EVSYS) IRQ 2 */
  EVSYS_3_IRQn             = 39, /**< 39 SAME54N19A Event System Interface (EVSYS) IRQ 3 */
  EVSYS_4_IRQn             = 40, /**< 40 SAME54N19A Event System Interface (EVSYS) IRQ 4 */
  PAC_IRQn                 = 41, /**< 41 SAME54N19A Peripheral Access Controller (PAC) */
  RAMECC_IRQn              = 45, /**< 45 SAME54N19A RAM ECC (RAMECC) */
  SERCOM0_0_IRQn           = 46, /**< 46 SAME54N19A Serial Communication Interface 0 (SERCOM0) IRQ 0 */
  SERCOM0_1_IRQn           = 47, /**< 47 SAME54N19A Serial Communication Interface 0 (SERCOM0) IRQ 1 */
  SERCOM0_2_IRQn           = 48, /**< 48 SAME54N19A Serial Communication Interface 0 (SERCOM0) IRQ 2 */
  SERCOM0_3_IRQn           = 49, /**< 49 SAME54N19A Serial Communication Interface 0 (SERCOM0) IRQ 3 */
  SERCOM1_0_IRQn           = 50, /**< 50 SAME54N19A Serial Communication Interface 1 (SERCOM1) IRQ 0 */
  SERCOM1_1_IRQn           = 51, /**< 51 SAME54N19A Serial Communication Interface 1 (SERCOM1) IRQ 1 */
  SERCOM1_2_IRQn           = 52, /**< 52 SAME54N19A Serial Communication Interface 1 (SERCOM1) IRQ 2 */
  SERCOM1_3_IRQn           = 53, /**< 53 SAME54N19A Serial Communication Interface 1 (SERCOM1) IRQ 3 */
  SERCOM2_0_IRQn           = 54, /**< 54 SAME54N19A Serial Communication Interface 2 (SERCOM2) IRQ 0 */
  SERCOM2_1_IRQn           = 55, /**< 55 SAME54N19A Serial Communication Interface 2 (SERCOM2) IRQ 1 */
  SERCOM2_2_IRQn           = 56, /**< 56 SAME54N19A Serial Communication Interface 2 (SERCOM2) IRQ 2 */
  SERCOM2_3_IRQn           = 57, /**< 57 SAME54N19A Serial Communication Interface 2 (SERCOM2) IRQ 3 */
  SERCOM3_0_IRQn           = 58, /**< 58 SAME54N19A Serial Communication Interface 3 (SERCOM3) IRQ 0 */
  SERCOM3_1_IRQn           = 59, /**< 59 SAME54N19A Serial Communication Interface 3 (SERCOM3) IRQ 1 */
  SERCOM3_2_IRQn           = 60, /**< 60 SAME54N19A Serial Communication Interface 3 (SERCOM3) IRQ 2 */
  SERCOM3_3_IRQn           = 61, /**< 61 SAME54N19A Serial Communication Interface 3 (SERCOM3) IRQ 3 */
  SERCOM4_0_IRQn           = 62, /**< 62 SAME54N19A Serial Communication Interface 4 (SERCOM4) IRQ 0 */
  SERCOM4_1_IRQn           = 63, /**< 63 SAME54N19A Serial Communication Interface 4 (SERCOM4) IRQ 1 */
  SERCOM4_2_IRQn           = 64, /**< 64 SAME54N19A Serial Communication Interface 4 (SERCOM4) IRQ 2 */
  SERCOM4_3_IRQn           = 65, /**< 65 SAME54N19A Serial Communication Interface 4 (SERCOM4) IRQ 3 */
  SERCOM5_0_IRQn           = 66, /**< 66 SAME54N19A Serial Communication Interface 5 (SERCOM5) IRQ 0 */
  SERCOM5_1_IRQn           = 67, /**< 67 SAME54N19A Serial Communication Interface 5 (SERCOM5) IRQ 1 */
  SERCOM5_2_IRQn           = 68, /**< 68 SAME54N19A Serial Communication Interface 5 (SERCOM5) IRQ 2 */
  SERCOM5_3_IRQn           = 69, /**< 69 SAME54N19A Serial Communication Interface 5 (SERCOM5) IRQ 3 */
  SERCOM6_0_IRQn           = 70, /**< 70 SAME54N19A Serial Communication Interface 6 (SERCOM6) IRQ 0 */
  SERCOM6_1_IRQn           = 71, /**< 71 SAME54N19A Serial Communication Interface 6 (SERCOM6) IRQ 1 */
  SERCOM6_2_IRQn           = 72, /**< 72 SAME54N19A Serial Communication Interface 6 (SERCOM6) IRQ 2 */
  SERCOM6_3_IRQn           = 73, /**< 73 SAME54N19A Serial Communication Interface 6 (SERCOM6) IRQ 3 */
  SERCOM7_0_IRQn           = 74, /**< 74 SAME54N19A Serial Communication Interface 7 (SERCOM7) IRQ 0 */
  SERCOM7_1_IRQn           = 75, /**< 75 SAME54N19A Serial Communication Interface 7 (SERCOM7) IRQ 1 */
  SERCOM7_2_IRQn           = 76, /**< 76 SAME54N19A Serial Communication Interface 7 (SERCOM7) IRQ 2 */
  SERCOM7_3_IRQn           = 77, /**< 77 SAME54N19A Serial Communication Interface 7 (SERCOM7) IRQ 3 */
  CAN0_IRQn                = 78, /**< 78 SAME54N19A Control Area Network 0 (CAN0) */
  CAN1_IRQn                = 79, /**< 79 SAME54N19A Control Area Network 1 (CAN1) */
  USB_0_IRQn               = 80, /**< 80 SAME54N19A Universal Serial Bus (USB) IRQ 0 */
  USB_1_IRQn               = 81, /**< 81 SAME54N19A Universal Serial Bus (USB) IRQ 1 */
  USB_2_IRQn               = 82, /**< 82 SAME54N19A Universal Serial Bus (USB) IRQ 2 */
  USB_3_IRQn               = 83, /**< 83 SAME54N19A Universal Serial Bus (USB) IRQ 3 */
  GMAC_IRQn                = 84, /**< 84 SAME54N19A Ethernet MAC (GMAC) */
  TCC0_0_IRQn              = 85, /**< 85 SAME54N19A Timer Counter Control 0 (TCC0) IRQ 0 */
  TCC0_1_IRQn              = 86, /**< 86 SAME54N19A Timer Counter Control 0 (TCC0) IRQ 1 */
  TCC0_2_IRQn              = 87, /**< 87 SAME54N19A Timer Counter Control 0 (TCC0) IRQ 2 */
  TCC0_3_IRQn              = 88, /**< 88 SAME54N19A Timer Counter Control 0 (TCC0) IRQ 3 */
  TCC0_4_IRQn              = 89, /**< 89 SAME54N19A Timer Counter Control 0 (TCC0) IRQ 4 */
  TCC0_5_IRQn              = 90, /**< 90 SAME54N19A Timer Counter Control 0 (TCC0) IRQ 5 */
  TCC0_6_IRQn              = 91, /**< 91 SAME54N19A Timer Counter Control 0 (TCC0) IRQ 6 */
  TCC1_0_IRQn              = 92, /**< 92 SAME54N19A Timer Counter Control 1 (TCC1) IRQ 0 */
  TCC1_1_IRQn              = 93, /**< 93 SAME54N19A Timer Counter Control 1 (TCC1) IRQ 1 */
  TCC1_2_IRQn              = 94, /**< 94 SAME54N19A Timer Counter Control 1 (TCC1) IRQ 2 */
  TCC1_3_IRQn              = 95, /**< 95 SAME54N19A Timer Counter Control 1 (TCC1) IRQ 3 */
  TCC1_4_IRQn              = 96, /**< 96 SAME54N19A Timer Counter Control 1 (TCC1) IRQ 4 */
  TCC2_0_IRQn              = 97, /**< 97 SAME54N19A Timer Counter Control 2 (TCC2) IRQ 0 */
  TCC2_1_IRQn              = 98, /**< 98 SAME54N19A Timer Counter Control 2 (TCC2) IRQ 1 */
  TCC2_2_IRQn              = 99, /**< 99 SAME54N19A Timer Counter Control 2 (TCC2) IRQ 2 */
  TCC2_3_IRQn              = 100, /**< 100 SAME54N19A Timer Counter Control 2 (TCC2) IRQ 3 */
  TCC3_0_IRQn              = 101, /**< 101 SAME54N19A Timer Counter Control 3 (TCC3) IRQ 0 */
  TCC3_1_IRQn              = 102, /**< 102 SAME54N19A Timer Counter Control 3 (TCC3) IRQ 1 */
  TCC3_2_IRQn              = 103, /**< 103 SAME54N19A Timer Counter Control 3 (TCC3) IRQ 2 */
  TCC4_0_IRQn              = 104, /**< 104 SAME54N19A Timer Counter Control 4 (TCC4) IRQ 0 */
  TCC4_1_IRQn              = 105, /**< 105 SAME54N19A Timer Counter Control 4 (TCC4) IRQ 1 */
  TCC4_2_IRQn              = 106, /**< 106 SAME54N19A Timer Counter Control 4 (TCC4) IRQ 2 */
  TC0_IRQn                 = 107, /**< 107 SAME54N19A Basic Timer Counter 0 (TC0) */
  TC1_IRQn                 = 108, /**< 108 SAME54N19A Basic Timer Counter 1 (TC1) */
  TC2_IRQn                 = 109, /**< 109 SAME54N19A Basic Timer Counter 2 (TC2) */
  TC3_IRQn                 = 110, /**< 110 SAME54N19A Basic Timer Counter 3 (TC3) */
  TC4_IRQn                 = 111, /**< 111 SAME54N19A Basic Timer Counter 4 (TC4) */
  TC5_IRQn                 = 112, /**< 112 SAME54N19A Basic Timer Counter 5 (TC5) */
  TC6_IRQn                 = 113, /**< 113 SAME54N19A Basic Timer Counter 6 (TC6) */
  TC7_IRQn                 = 114, /**< 114 SAME54N19A Basic Timer Counter 7 (TC7) */
  PDEC_0_IRQn              = 115, /**< 115 SAME54N19A Quadrature Decodeur (PDEC) IRQ 0 */
  PDEC_1_IRQn              = 116, /**< 116 SAME54N19A Quadrature Decodeur (PDEC) IRQ 1 */
  PDEC_2_IRQn              = 117, /**< 117 SAME54N19A Quadrature Decodeur (PDEC) IRQ 2 */
  ADC0_0_IRQn              = 118, /**< 118 SAME54N19A Analog Digital Converter 0 (ADC0) IRQ 0 */
  ADC0_1_IRQn              = 119, /**< 119 SAME54N19A Analog Digital Converter 0 (ADC0) IRQ 1 */
  ADC1_0_IRQn              = 120, /**< 120 SAME54N19A Analog Digital Converter 1 (ADC1) IRQ 0 */
  ADC1_1_IRQn              = 121, /**< 121 SAME54N19A Analog Digital Converter 1 (ADC1) IRQ 1 */
  AC_IRQn                  = 122, /**< 122 SAME54N19A Analog Comparators (AC) */
  DAC_0_IRQn               = 123, /**< 123 SAME54N19A Digital-to-Analog Converter (DAC) IRQ 0 */
  DAC_1_IRQn               = 124, /**< 124 SAME54N19A Digital-to-Analog Converter (DAC) IRQ 1 */
  DAC_2_IRQn               = 125, /**< 125 SAME54N19A Digital-to-Analog Converter (DAC) IRQ 2 */
  DAC_3_IRQn               = 126, /**< 126 SAME54N19A Digital-to-Analog Converter (DAC) IRQ 3 */
  DAC_4_IRQn               = 127, /**< 127 SAME54N19A Digital-to-Analog Converter (DAC) IRQ 4 */
  I2S_IRQn                 = 128, /**< 128 SAME54N19A Inter-IC Sound Interface (I2S) */
  PCC_IRQn                 = 129, /**< 129 SAME54N19A Parallel Capture Controller (PCC) */
  AES_IRQn                 = 130, /**< 130 SAME54N19A Advanced Encryption Standard (AES) */
  TRNG_IRQn                = 131, /**< 131 SAME54N19A True Random Generator (TRNG) */
  ICM_IRQn                 = 132, /**< 132 SAME54N19A Integrity Check Monitor (ICM) */
  PUKCC_IRQn               = 133, /**< 133 SAME54N19A PUblic-Key Cryptography Controller (PUKCC) */
  QSPI_IRQn                = 134, /**< 134 SAME54N19A Quad SPI interface (QSPI) */
  SDHC0_IRQn               = 135, /**< 135 SAME54N19A SD/MMC Host Controller 0 (SDHC0) */
  SDHC1_IRQn               = 136, /**< 136 SAME54N19A SD/MMC Host Controller 1 (SDHC1) */

